; domain
(define (domain block-words)
  (:requirements :strips :typing :equality)
  (:types block)
  (:predicates (on ?x ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y - block)
	     :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y)))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y)))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem block-words)
	(:domain block-words)
	(:objects
		d l b i s r p k n t h - block
	)
	(:init
		(handempty)
		(clear p)
		(ontable p)
		(clear n)
		(ontable n)
		(clear k)
		(ontable k)
		(clear l)
		(on l b)
		(ontable b)
		(clear s)
		(on s i)
		(ontable i)
		(clear t)
		(on t r)
		(ontable r)
		(clear h)
		(on h d)
		(ontable d)
	)
	(:goal (and
		;; brink
		(clear b) (ontable k) (on b r) (on r i) (on i n) (on n k) 
	))
)

; plan
1. (pick-up n)
   deleted: (ontable n) (clear n) (handempty)
   added: (holding n)
   goals met: 1 of 6
2. (stack n k)
   deleted: (holding n) (clear k)
   added: (clear n) (handempty) (on n k)
   goals met: 2 of 6
3. (unstack s i)
   deleted: (clear s) (handempty) (on s i)
   added: (holding s) (clear i)
   goals met: 2 of 6
4. (put-down s)
   deleted: (holding s)
   added: (clear s) (handempty) (ontable s)
   goals met: 2 of 6
5. (pick-up i)
   deleted: (ontable i) (clear i) (handempty)
   added: (holding i)
   goals met: 2 of 6
6. (stack i n)
   deleted: (holding i) (clear n)
   added: (clear i) (handempty) (on i n)
   goals met: 3 of 6
7. (unstack t r)
   deleted: (clear t) (handempty) (on t r)
   added: (holding t) (clear r)
   goals met: 3 of 6
8. (stack t p)
   deleted: (holding t) (clear p)
   added: (clear t) (handempty) (on t p)
   goals met: 3 of 6
9. (pick-up r)
   deleted: (ontable r) (clear r) (handempty)
   added: (holding r)
   goals met: 3 of 6
10. (stack r i)
   deleted: (holding r) (clear i)
   added: (clear r) (handempty) (on r i)
   goals met: 4 of 6
11. (unstack l b)
   deleted: (clear l) (handempty) (on l b)
   added: (holding l) (clear b)
   goals met: 5 of 6
12. (put-down l)
   deleted: (holding l)
   added: (clear l) (handempty) (ontable l)
   goals met: 5 of 6
13. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 4 of 6
14. (stack b r)
   deleted: (holding b) (clear r)
   added: (clear b) (handempty) (on b r)
   goals met: 6 of 6
